## 7.1 Handling Missing Data

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned = data.dropna()

In [16]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4] = NA

In [19]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))

In [23]:
df.iloc[:4, 1] = NA

In [24]:
df.iloc[:2, 2] = NA

In [25]:
df

          0         1         2
0  0.330656       NaN       NaN
1  0.021164       NaN       NaN
2  0.291879       NaN  0.748157
3 -0.726829       NaN  0.462060
4  0.336146  1.808482 -1.081880
5 -0.984508  1.099187 -0.493766
6  0.064096 -1.161654  1.315986

In [26]:
df.dropna()

          0         1         2
4  0.336146  1.808482 -1.081880
5 -0.984508  1.099187 -0.493766
6  0.064096 -1.161654  1.315986

In [31]:
df.dropna(thresh=2)

          0         1         2
2  0.291879       NaN  0.748157
3 -0.726829       NaN  0.462060
4  0.336146  1.808482 -1.081880
5 -0.984508  1.099187 -0.493766
6  0.064096 -1.161654  1.315986

### Filling In Missing Data

In [32]:
df.fillna(0)

          0         1         2
0  0.330656  0.000000  0.000000
1  0.021164  0.000000  0.000000
2  0.291879  0.000000  0.748157
3 -0.726829  0.000000  0.462060
4  0.336146  1.808482 -1.081880
5 -0.984508  1.099187 -0.493766
6  0.064096 -1.161654  1.315986

In [33]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.330656  0.500000  0.000000
1  0.021164  0.500000  0.000000
2  0.291879  0.500000  0.748157
3 -0.726829  0.500000  0.462060
4  0.336146  1.808482 -1.081880
5 -0.984508  1.099187 -0.493766
6  0.064096 -1.161654  1.315986

In [34]:
_ = df.fillna(0, inplace=True)

In [35]:
df

          0         1         2
0  0.330656  0.000000  0.000000
1  0.021164  0.000000  0.000000
2  0.291879  0.000000  0.748157
3 -0.726829  0.000000  0.462060
4  0.336146  1.808482 -1.081880
5 -0.984508  1.099187 -0.493766
6  0.064096 -1.161654  1.315986

In [36]:
df = pd.DataFrame(np.random.randn(6, 3))

In [37]:
df.iloc[2:, 1] = NA

In [38]:
df.iloc[4:, 2] = NA

In [39]:
df

          0         1         2
0 -2.347708  0.223885 -0.839894
1  0.568709  0.008214  0.625897
2 -1.596203       NaN  0.029785
3 -0.686932       NaN -0.450862
4  0.823978       NaN       NaN
5 -0.877721       NaN       NaN

In [40]:
df.fillna(method='ffill')

          0         1         2
0 -2.347708  0.223885 -0.839894
1  0.568709  0.008214  0.625897
2 -1.596203  0.008214  0.029785
3 -0.686932  0.008214 -0.450862
4  0.823978  0.008214 -0.450862
5 -0.877721  0.008214 -0.450862

In [41]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -2.347708  0.223885 -0.839894
1  0.568709  0.008214  0.625897
2 -1.596203  0.008214  0.029785
3 -0.686932  0.008214 -0.450862
4  0.823978       NaN -0.450862
5 -0.877721       NaN -0.450862

In [42]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [43]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

### Removing Duplicates

In [44]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [45]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [46]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [47]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [48]:
data['v1'] = range(7)

In [49]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [50]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [51]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [54]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon', 
                              'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [55]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [56]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'pig', 
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [57]:
lowercased = data['food'].str.lower()

In [58]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [59]:
data['animal'] = lowercased.map(meat_to_animal)

In [60]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     pig
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [61]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       pig
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [69]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [70]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [71]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [72]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [73]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [76]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [77]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [78]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [79]:
transform = lambda x: x[:4].upper()

In [81]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [82]:
data.index = data.index.map(transform)

In [83]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [85]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [87]:
data.rename(index={'OHIO': 'INDIANA'},
             columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [88]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [89]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [90]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [91]:
bins = [18, 25, 30, 60, 100]

In [95]:
cats = pd.cut(ages, bins)

In [96]:
cats

[(18, 25], (18, 25], (18, 25], (25, 30], (18, 25], ..., (30, 60], (60, 100], (30, 60], (30, 60], (30, 60]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 30] < (30, 60] < (60, 100]]

In [97]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 2, 3, 2, 2, 2], dtype=int8)

In [99]:
cats.categories

IntervalIndex([(18, 25], (25, 30], (30, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [100]:
pd.value_counts(cats)

(30, 60]     5
(18, 25]     5
(60, 100]    1
(25, 30]     1
dtype: int64

In [104]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [105]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [106]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., MiddleAged, Senior, MiddleAged, MiddleAged, MiddleAged]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [110]:
pd.cut(ages, bins, labels=group_names).value_counts()

Youth         5
YoungAdult    1
MiddleAged    5
Senior        1
dtype: int64

In [111]:
data = np.random.rand(20)

In [114]:
pd.cut(data, 4, precision=2)

[(0.26, 0.51], (0.75, 1.0], (0.014, 0.26], (0.014, 0.26], (0.75, 1.0], ..., (0.26, 0.51], (0.51, 0.75], (0.26, 0.51], (0.014, 0.26], (0.51, 0.75]]
Length: 20
Categories (4, interval[float64]): [(0.014, 0.26] < (0.26, 0.51] < (0.51, 0.75] < (0.75, 1.0]]

In [115]:
data = np.random.randn(1000)

In [117]:
cats = pd.qcut(data, 4)

In [118]:
cats

[(-3.102, -0.722], (-0.0357, 0.652], (0.652, 2.624], (-0.0357, 0.652], (-0.0357, 0.652], ..., (-0.722, -0.0357], (-3.102, -0.722], (-3.102, -0.722], (0.652, 2.624], (-0.0357, 0.652]]
Length: 1000
Categories (4, interval[float64]): [(-3.102, -0.722] < (-0.722, -0.0357] < (-0.0357, 0.652] < (0.652, 2.624]]

In [119]:
pd.value_counts(cats)

(0.652, 2.624]       250
(-0.0357, 0.652]     250
(-0.722, -0.0357]    250
(-3.102, -0.722]     250
dtype: int64

In [120]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])

[(-1.324, -0.0357], (-0.0357, 1.285], (-0.0357, 1.285], (-0.0357, 1.285], (-0.0357, 1.285], ..., (-1.324, -0.0357], (-1.324, -0.0357], (-1.324, -0.0357], (-0.0357, 1.285], (-0.0357, 1.285]]
Length: 1000
Categories (4, interval[float64]): [(-3.102, -1.324] < (-1.324, -0.0357] < (-0.0357, 1.285] < (1.285, 2.624]]

In [121]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1]).value_counts()

(-3.102, -1.324]     100
(-1.324, -0.0357]    400
(-0.0357, 1.285]     400
(1.285, 2.624]       100
dtype: int64